In [4]:
#augest 1 /2021 start page 174

In [ ]:
# explore data frame

In [2]:
import pandas as pd

In [6]:
#creating two series
data_name = pd.Series(["jayed","nahian","sagar","hasib","dipu"],name='person_name')
data_age = pd.Series([22,33,44,55],name= 'person_age')

In [7]:
#combine two series
dict_data = {
    "one":data_name,
    "two":data_age
}

In [9]:
#passing this dict to pandas data frame
data_dataframe = pd.DataFrame(dict_data)

In [10]:
data_dataframe
#keys will by defult act as column name

      one   two
0   jayed  22.0
1  nahian  33.0
2   sagar  44.0
3   hasib  55.0
4    dipu   NaN

## if we want to combine two series index conflict will create
### The resulting index will be the union of the indexes of the various Series.

In [27]:
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
    "three": pd.Series([1.0, 2.0, 3.0, 4.0,5.0,6.0], index=[1, 2, 3, 4,5,6])
}

In [29]:
d_df = pd.DataFrame(d)

In [30]:
d_df
# hears what happen ! all index will show but only common ones

   one  two  three
a  1.0  1.0    NaN
b  2.0  2.0    NaN
c  3.0  3.0    NaN
d  NaN  4.0    NaN
1  NaN  NaN    1.0
2  NaN  NaN    2.0
3  NaN  NaN    3.0
4  NaN  NaN    4.0
5  NaN  NaN    5.0
6  NaN  NaN    6.0

In [32]:
# rename all the columns name and index name

In [33]:
d_df = pd.DataFrame(d,index=["a","b","c","d","e","f"],columns=["one","two","three"])

In [34]:
d_df

   one  two  three
a  1.0  1.0    NaN
b  2.0  2.0    NaN
c  3.0  3.0    NaN
d  NaN  4.0    NaN
e  NaN  NaN    NaN
f  NaN  NaN    NaN

# list > dict > dataframe
## list inside dictionary

In [42]:

d = {
    "one": [1.0, 2.0, 3.0, 4.0],
    "two": [4.0, 3.0, 2.0, 1.0]
}

In [43]:
d

{'one': [1.0, 2.0, 3.0, 4.0], 'two': [4.0, 3.0, 2.0, 1.0]}

In [50]:
pd.DataFrame(d,index = ["a","b","c","d"],columns=["one","two","three"])

   one  two three
a  1.0  4.0   NaN
b  2.0  3.0   NaN
c  3.0  2.0   NaN
d  4.0  1.0   NaN

# dictionary > list > data frame
## dictionary inside list

In [52]:
data_2 = [
    {
        "a":"nahian",
        "b":"hasib"
    },
    {
        "a":"sagar",
        "b":"dipu"
    }
]

In [53]:
data_2

[{'a': 'nahian', 'b': 'hasib'}, {'a': 'sagar', 'b': 'dipu'}]

In [54]:
pd.DataFrame(data_2)

        a      b
0  nahian  hasib
1   sagar   dipu

In [59]:
div_one={
    "a":"nahian",
    "b":"hasib"
}

div_two ={
    "a":"sagar",
    "b":"dipu",
    "c":"niloy"
}

In [60]:
pd.DataFrame([div_one,div_two])

        a      b      c
0  nahian  hasib    NaN
1   sagar   dipu  niloy

# data frame operation

In [66]:

d = {
    "one": [1.0, 2.0, 3.0, 4.0],
    "two": [4.0, 3.0, 2.0, 1.0],
    "three": [6.0, 7.0, 8.0, 9.0]
}

In [67]:
df_2=pd.DataFrame(d,index = ["a","b","c","d"],columns=["one","two","three"])

In [68]:
df_2

   one  two  three
a  1.0  4.0    6.0
b  2.0  3.0    7.0
c  3.0  2.0    8.0
d  4.0  1.0    9.0

In [73]:
df_2["four"]= df_2['one']*df_2["two"]

In [75]:
df_2[:2]

   one  two  three  four
a  1.0  4.0    6.0   4.0
b  2.0  3.0    7.0   6.0